app/controllers/v1/items_controller.rb

  def create
    @todo.items.create!(item_params)
---
INSERT INTO "items" ("name", "todo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Listen to Don Giovanni"], ["todo_id", 1], ["created_at", 2019-06-21 13:02:45 UTC], ["updated_at", 2019-06-21 13:02:45 UTC]]

  def set_todo
    @todo = Todo.find(params[:todo_id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_todo_item
    @item = @todo.items.find_by!(id: params[:id]) if @todo
---
SELECT "items".* FROM "items" WHERE "items"."todo_id" = ?  [["todo_id", 1]]