hello-api/app/controllers/users_controller.rb

  def create
    user = User.create!(user_params)
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)